app/controllers/authors_controller.rb

SELECT "authors".* FROM "authors"
SELECT "authors".* FROM "authors" ORDER BY Authours.created_at desc LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "authors"
---
  def index
    @authors = Author.all
    @filterrific = initialize_filterrific(
      Author,
      params[:filterrific],
      select_options: {
        sorted_by: Author.options_for_sorted_by
      }
    ) or return

    @authors = @filterrific.find.paginate(page: params[:page], per_page: 10)